bytes/daily-good-articles/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Daily Good Articles</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Daily Good Articles"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-12 19:59:06 CEST"/>
<meta name="author" content="Torstein Krause Johansen"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>

<div id="preamble">
<svg
        id="vizrt-logo"
        version="1.1"
        width="138"
        height="84"
        > 
  <g
          id="g12"
          transform="matrix(1.25,0,0,-1.25,-451.34003,425.24315)"> 
    <g
            id="g14"
            transform="matrix(0.0246257,0,0,0.02458666,313.76213,231.21317)"> 
      <path
              d="m 3060.56,3437.2 -209.9,-593.4 -207.05,593.4 -215.82,0 326.08,-866.38 184.92,0 332.24,866.38 -210.47,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path16"/> 
      <path
              d="m 3473.3,2569.82 193.547,0 0,866.531 -193.547,0 0,-866.531 z"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path18"/> 
      <path
              d="m 3916.16,3436.36 -0.14,-177.24 364.23,0 -372.91,-554.74 0,-133.56 616.08,0 0,175.25 -374.66,0 366.68,550.78 0,139.51 -599.28,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path20"/> 
      <path
              d="m 4961.8,3436.66 c -56.15,0 -99.9,-9.02 -144.01,-53.04 -42.13,-42.13 -63.55,-93.63 -63.55,-153.7 l 0,-658.85 193.26,0 0,629.18 c 0,16.39 5.76,30.04 17.53,41.82 9.79,9.87 32.16,17.44 52.18,17.44 l 161.49,0 0,177.15 -216.9,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path22"/> 
      <path
              d="m 5367.91,3699.54 0,-915.91 c 0,-58.68 20.75,-109.43 62.13,-150.8 43.31,-43.47 85.57,-62.01 141.03,-62.01 l 212.69,0 0,174.7 -158.78,0 c -15.96,0 -28.96,5.5 -40.72,16.87 -11.19,11.53 -16.76,24.5 -16.76,40.65 l 0,456.42 216.26,0 0,176.39 -216.26,0 0,263.69 -199.59,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path24"/> 
      <path
              d="m 1921.16,3066.86 c -0.39,-514.15 173.24,-988.49 465.56,-1367.51 l 69.26,204.63 c -205.49,300.61 -333.44,658.06 -355.3,1043.68 l -179.52,119.2"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path26"/> 
      <path
              d="m 6404.28,3065.28 c 0.49,513.97 -173.17,988.55 -465.37,1367.26 l -69.46,-204.34 c 205.52,-300.7 333.61,-658.34 355.24,-1043.68 l 179.59,-119.24"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path28"/> 
 
    </g> 
  </g> 
</svg>

</div>

<div id="content">
<h1 class="title">Daily Good Articles</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 2012-07-12</a>
<ul>
<li><a href="#sec-1-1">1.1 nginx srcache and memc backend, updating the memcached directly (or not)</a></li>
<li><a href="#sec-1-2">1.2 Understanding the HTTP Vary Header and Caching Proxies (Squid, etc.)</a></li>
</ul>
</li>
<li><a href="#sec-2">2 2012-06-27</a>
<ul>
<li><a href="#sec-2-1">2.1 Tomcat performance tuning</a></li>
</ul>
</li>
<li><a href="#sec-3">3 2012-06-25</a>
<ul>
<li><a href="#sec-3-1">3.1 Manage sessions closely</a></li>
<li><a href="#sec-3-2">3.2 A Formal Introduction to The Ubuntu Orchestra Project</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 2012-07-12</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> nginx srcache and memc backend, updating the memcached directly (or not)</h3>
<div class="outline-text-3" id="text-1-1">

<p><a href="http://forum.nginx.org/read.php?2,225568,225568">http://forum.nginx.org/read.php?2,225568,225568</a>
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Understanding the HTTP Vary Header and Caching Proxies (Squid, etc.)</h3>
<div class="outline-text-3" id="text-1-2">

<p><a href="http://mark.koli.ch/2010/09/understanding-the-http-vary-header-and-caching-proxies-squid-etc.html">http://mark.koli.ch/2010/09/understanding-the-http-vary-header-and-caching-proxies-squid-etc.html</a>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2012-06-27</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Tomcat performance tuning</h3>
<div class="outline-text-3" id="text-2-1">

<p><a href="http://www.springsource.com/files/u1/PerformanceTuningApacheTomcat-Part2.pdf">http://www.springsource.com/files/u1/PerformanceTuningApacheTomcat-Part2.pdf</a>
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 2012-06-25</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Manage sessions closely</h3>
<div class="outline-text-3" id="text-3-1">

<p><a href="http://www.javapractices.com/topic/TopicAction.do?Id=191">http://www.javapractices.com/topic/TopicAction.do?Id=191</a>
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> A Formal Introduction to The Ubuntu Orchestra Project</h3>
<div class="outline-text-3" id="text-3-2">

<p><a href="http://blog.dustinkirkland.com/2011/08/formal-introduction-to-ubuntu-orchestra.html">http://blog.dustinkirkland.com/2011/08/formal-introduction-to-ubuntu-orchestra.html</a>
</p>
<p>
<a href="http://bazaar.launchpad.net/~orchestra/orchestra/trunk/view/head:/debian/control">http://bazaar.launchpad.net/~orchestra/orchestra/trunk/view/head:/debian/control</a>
</p>
<p>
<a href="https://fedorahosted.org/cobbler/">https://fedorahosted.org/cobbler/</a>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<hr/>
<p class="author">
  Author: Torstein Krause Johansen (<a href="mailto:torstein.k.johansen@gmail.com">torstein.k.johansen@gmail.com</a>)
  Date: 2012-07-12 19:59:06 CEST
</p>
</div>
</body>
</html>
